'use strict';
/*
 * Циклы (while, do...while, for)
 */

/*
 * While
 */

// while (condition) {
// код, тело цикла (statement)
// }

/*
? Выведите числа от 1 до 50
*/

// let num = 1;

// while (num <= 50) {
//   console.log(num);

//   num += 1;
// }

/*
? Найдите сумму чисел от 1 до 100
 */

/*
? Дано число n=1000.
? Делите его на 2 столько раз, пока результат деления не станет меньше 50.
? Какое число получится?
? Посчитайте количество итераций, необходимых для этого, и запишите его в переменную num.
*/

// let n = 1000;
// let counter = 0;

// console.log(counter);
// console.log(n);

/*
 * Do While
 */
// do {
// statement
// } while (condition);

/*
? Напишите цикл, который предлагает prompt ввести число, большее 100.
? Если посетитель ввёл другое число – попросить ввести ещё раз, и так далее.
? Цикл должен спрашивать число пока посетитель не введёт число, большее 100.
? Предполагается, что посетитель вводит только числа;
*/

/*
 * For
 */
// for (инициализация; условие; пост-выражение) {
// тело цикла
// }

// for (let i = 0; i < 10; i += 1) {
//   console.log(i);
// }

/*
? При помощи цикла for выведите чётные числа от 2 до 10. Используйте дериктиву continue
*/

/*
? При помощи цикла for найдите число 3 и при нахождении выведите 'Мы нашли 3'. Используйте дериктиву break
*/

/*
? Напишите программу, которая выводит через console.log все числа от 1 до 100, с тремя исключениями. 
? Для чисел, нацело делящихся на 3, она должна выводить ‘Fizz’,
? а для чисел, делящихся на 5 – ‘Buzz’.
? Для чисел которые кратны 3 и 5 = 'FizzBuzz'
*/

/*
 ? Выведите методом console.log() звездочки от 1 до 7 штук в виде  треугольника таким образом:
 ? *
 ? **
 ? ***
 ? ****
 ? *****
 ? ******
 ? *******
 */

// Область бачення:

// for (let i = 100; i >= 0; i -= 1) {
//   console.log(i);
// }

// const number = 20; // 20

// if (true) {
//   const number = 10; // 10

//   console.log(number); // 10
// }

// console.log(number); // 20

// for (let i = 100; i >= 0; i -= 1) {
//   console.log(i);
// }

// const i = 618;

// for (let i = 0; i <= 100; i += 1) {
//   console.log(i);
// }
