'use strict';
/*
 * Функциональные выражения и объявление функции.
 * Параметры, аргументы, возврат.
 */

// function имя_функции(праметр_1, параметр_2...) {
// тело функции
// }

/*
? Напиши функцию calcBMI(weight, height) которая рассчитывает и возвращает индекс массы тела человека.
? Для этого необходимо разделить вес в киллограммах на квадрат высоты человека в метрах.
? Вес и высота будут специально переданы как строки. Нецелые числа могут быть заданы в виде 24.7 или 24,7,
? то есть в качестве разделителя дробной части может быть запятая.
? Индекс массы тела необходимо округлить до одной цифры после запятой;
*/

/*
? Напиши функцию min(a,b), которая возвращает меньшее из чисел a и b.
*/

/*
? Напиши функцию getRectArea(dimensions) для вычисления площади прямоугольника со сторонами,
? значения которых будут переданы в параметр dimensions в виде строки.
? Значения гарантированно разделены пробелом.
*/

/*
? Напиши функцию logItems(items), которая получает массив и использует цикл for,
? который для каждого элемента массива будет выводить в консоль сообщение
? в формате <номер элемента> - <значение элемента>. Нумерация элементов должна начинаться с 1.
? Например для первого элемента массива ['Mango', 'Poly', 'Ajax'] с индексом 0 будет выведено '1 - Mango',
? а для индекса 2 выведет '3 - Ajax'.
*/

/*
? Напиши функцию printContactsInfo(names, phones) которая выводит в консоль имя и телефонный номер пользователя.
? В параметры names и phones будут переданы строки имен и телефонных номеров, разделенные запятыми.
? Порядковый номер имен и телефонов в строках указывают на соответствие.
? Количество имен и телефонов гарантированно одинаковое.
*/

// printContactsInfo(
//   'Jacob,William,Solomon,Artemis',
//   '89001234567,89001112233,890055566377,890055566300'
// );

// printContactsInfo('Vera,Carr,Violet,Sherman', '89001234567,89001112233,890055566377,890055566300');

/*
? Напиши функцию findLargestNumber(numbers)которая ищет самое большое число в массиве.
*/

/*
? Напишите функцию calcAverage() которая принимает произвольное кол-во аргументов и возвращает их среднее значение.
? Все аругменты будут только числами. Тут покажи решение с псевдомасивом arguments и расскажи про его особенности
*/

/*
? Напишите функции для работы с коллекцией обучающих курсов courses:
? addCourse(name) - добавляет курс в конец коллекции
? removeCourse(name) - удаляет курс из коллекции
? updateCourse(oldName, newName) - изменяет имя на новое
? Додати виключення (логи) у випадках коли курс є/нема в масиві
*/

// const courses = ['HTML', 'CSS', 'JavaScript', 'React', 'PostgreSQL'];
