'use strict';
/*
 *  Массивы: литерал массива, элементы, индексация, длина
 */

/*

/*
 * Передача по ссылке и по значению, різниця між примітивами та об'єктом
 */

/*
? Создайте переменную a = 10.
? Создайте и присвойте переменной b -> переменную a
? Вывидите в консоль обе этих переменных
? Измените значение переменной a и ещё раз выведете в консоль
*/

/*
? Создайте массив arr1 = [1, 2, 3].
? Создайте и присвойте массиву arr2 -> массив arr1
? Выве дите в консоль оба эти массива
? Добавьте элемент в массив arr1 и ещё раз выведете оба массива в консоль
*/

/*
 * Перебор массива циклами for и for...of
 */

/*
? Напиши скрипт для перебора массива fruits циклом for.
? Для каждого элемента массива выведи в консоль строку в формате номер_элемента: значение_элемента.
? Нумерация элементов должна начинаться с 1.
*/

// const fruits = ['🍎', '🍇', '🍑', '🍌', '🍋'];

/*
? Напиши скрипт поиска самого маленького числа в массиве.
? Код должен работать для любого массива чисел.
? Используй цикл for для решения задачи (перший варіант) і for of (другий варіант).
*/

// const numbers = [2, 17, 94, 1, -20, -1, 23, 37];

/*
? У нас есть массив с зарплатами сотрудников, нужно посчитать общую сумму зарплат.
? Покажи рішення двома варіантами (з циклом for та for of)
*/

// const salaries = [200, 450, 600, 150, 300];
// let total = 0;

/*
 * Базовые методы: split и join, indexOf и includes, push, pop, shift, unshift, slice и splice, concat
 */

// ? Создайте массив genres с элементами «Jazz» и «Blues».
// ? Добавьте «Rock&Roll» в конец.
// ? Выведите в консоль первый элемент массива.
// ? Выведите в консоль последний элемент массива. Код должен работать для массива произвольной длины.
// ? Удалите первый и последний элемент и выведите его в консоль.
// ? Вставьте «Country» и «Reggy» в начало массива.
//  */

/*
? У нас есть несколько массивов с зарплатами сотрудников из разных отделов, нужно посчитать общую сумму зарплат.
? Придумай варіанти рішення через цикли, через push та через concat
*/

// const managerSalaries = [100, 150, 250, 400, 500];
// const developersSalaries = [800, 1500, 4000];
// let total = 0;

/*
? Напиши скрипт для вычисления площади прямоугольника со сторонами,
? значения которых хранятся в переменной values в виде строки.
? Значения гарантированно разделены пробелом.
*/

// const values = '8 11';

/*
? Напиши скрипт который выводит в консоль имя и телефонный номер пользователя.
? В переменных names и phones хранятся строки имен и телефонных номеров, разделенные запятыми.
? Порядковый номер имен и телефонов в строках указывают на соответствие.
? Количество имен и телефонов гарантированно одинаковое.
*/

// const names = 'Jacob,William,Solomon,Artemis';

// const phones = '89001234567,89001112233,890055566377,890055566300';

/*
? Напиши скрипт который «разворачивает» строку (обратный порядок букв)
? и выводит ее в консоль.
? Покажи три варіанти з push + join, цикл, метод reverse
*/

/*
? У нас есть массив сотрудников, отфльтруйте его, чтобы сотрудники не повторялись
? Показати варіанти з indexOf, includes 
*/

// const employees = ['Dennis', 'Shaw', 'Watkins', 'Ray', 'Shaw', 'Watkins'];

// ? Сотрудник Shaw уволился, удалите его из массива з допомогою splice + indexOf

// //? Добавьте нового сотрудника Thornton, перед Watkins;

// Розділення з допомогою split та join

/*
? slug
? Отримати результат title-about-array-methods зі строки 'Title about array methods', дайте якомога більше варіантів
*/
