'use strict';
/*
 * Конкатенация строк, шаблонные строки
 */

/*
  ? Запросите у пользователя имя с возрастом и выведете в консоль сообщение:
  ? Hello имя_пользователя, your age is возраст_пользователя .
*/

//? Выполните задачу выше, используя шаблонные строки

/*
 * Свойства и Методы строк endsWith, slice, includes, indexOf, toLowerCase, toUpperCase, replace,
 * replaceAll властивість length, індексування
 */

//? Запросите у пользователя имя и узнайте из скольких символов, состоит имя.

//? Попросите пользователя ввести email и переведите в нижний регистр.

//? Попросите пользователя ввести email и переведите в верхний регистр

/*
  ? Есть строка 'HTML, CSS, JS, PHP, React, Vue, Node.js, C, C++'.
  ? Узнайте есть ли в этой строке язык: 'JavaScript', или 'JS'?.
  ? Если есть, узнайте позицию на которой находиться данная подстрока
*/

//? У нас есть строка '24px', узнайте на что заканчивается данная строка, на %, rem, em или px;

//? У нас есть строка '23,4', замените запятую на точку

/*
  ? У нас есть строка:
  ? 'The quick brown fox jumps over the lazy dog. If the dog reacted, was it really lazy?'.
  ? Замените все вхожденя dog на monkey.
*/

//? У нас есть дата в формате '12:05:21', замените (:) на (.)

/*
  ? Данна строка 'Vasyl Pupkin is 24 years old'.
  ? Скопируйте с этой строки отдельно имя с фамилией и отдельно возраст.
*/
